{
  "title": "Common Annoying Habits Women Notice in Men",
  "description": "A collection of behaviors that many women find frustrating in their interactions with men, based on surveys, studies, and online discussions.",
  "items": [
    {
      "habit": "Not listening or interrupting frequently",
      "description": "Cutting off conversations, not paying attention when someone is speaking, or waiting to talk rather than actively listening.",
      "reference": "Psychology Today - Active Listening in Relationships, multiple relationship forums including Reddit r/AskWomen"
    },
    {
      "habit": "Poor hygiene or grooming habits",
      "description": "Neglecting basic personal care like showering regularly, oral hygiene, or wearing clean clothes.",
      "reference": "Survey data from dating apps and relationship advice columns (e.g., Match.com surveys on dating deal-breakers)"
    },
    {
      "habit": "Mansplaining",
      "description": "Explaining things in a condescending or patronizing way, especially topics the woman already knows about or has expertise in.",
      "reference": "Term popularized by Rebecca Solnit's essay 'Men Explain Things to Me' (2008), widely discussed across media"
    },
    {
      "habit": "Not doing fair share of household chores",
      "description": "Expecting partners to handle most domestic tasks or needing to be asked/reminded to contribute.",
      "reference": "Pew Research Center studies on household labor division, sociological research on emotional labor"
    },
    {
      "habit": "Poor communication about feelings",
      "description": "Being emotionally unavailable, not expressing feelings clearly, or shutting down during important conversations.",
      "reference": "John Gottman's relationship research, American Psychological Association articles on communication in relationships"
    },
    {
      "habit": "Excessive bragging or self-centeredness",
      "description": "Constantly talking about oneself, achievements, or possessions without showing interest in others.",
      "reference": "Dating surveys and relationship psychology literature, common theme in advice columns"
    },
    {
      "habit": "Being glued to phone or screens",
      "description": "Constantly checking phones during conversations or quality time, ignoring present company for digital devices.",
      "reference": "Studies on technology and relationships, including research from University of Arizona on 'phubbing'"
    },
    {
      "habit": "Not planning or taking initiative",
      "description": "Always expecting the partner to make plans, decisions, or handle logistics without contributing ideas or effort.",
      "reference": "Research on emotional labor and mental load in relationships, discussed in 'Fed Up' by Gemma Hartley"
    },
    {
      "habit": "Making misogynistic or sexist jokes",
      "description": "Using humor that demeans women or relies on gender stereotypes, then dismissing concerns as 'just a joke'.",
      "reference": "Social psychology research on benevolent and hostile sexism, widely discussed in feminist literature"
    },
    {
      "habit": "Not respecting boundaries",
      "description": "Pushing past stated limits, ignoring 'no', or making someone feel guilty for setting boundaries.",
      "reference": "Consent education materials, relationship psychology research on healthy boundaries"
    },
    {
      "habit": "Being overly jealous or controlling",
      "description": "Exhibiting possessive behavior, checking up constantly, or trying to control who someone sees or what they wear.",
      "reference": "Relationship psychology literature, resources on healthy vs unhealthy relationships from organizations like Love Is Respect"
    },
    {
      "habit": "Leaving messes for others to clean",
      "description": "Not cleaning up after oneself, leaving dishes in the sink, clothes on the floor, or expecting others to tidy up.",
      "reference": "Common complaint in relationship forums, discussed in studies on domestic labor distribution"
    },
    {
      "habit": "Not remembering important dates or details",
      "description": "Forgetting birthdays, anniversaries, or important information that's been shared multiple times.",
      "reference": "Relationship advice literature, common theme in surveys about relationship frustrations"
    },
    {
      "habit": "Unsolicited advice or trying to 'fix' everything",
      "description": "Immediately jumping to solutions when someone just wants to vent or be heard, not respecting that venting is valid.",
      "reference": "Deborah Tannen's work on gender and communication styles, relationship communication research"
    },
    {
      "habit": "Making everything a competition",
      "description": "Turning conversations or activities into contests, one-upping stories, or needing to 'win' all the time.",
      "reference": "Research on masculine socialization and competitiveness, relationship dynamics literature"
    }
  ],
  "notes": "This data is compiled from publicly available research, surveys, and online discussions. Individual experiences vary, and not all men exhibit these behaviors, nor are they exclusive to men.",
  "lastUpdated": "2026-02-07"
}
